Revit 2026 API

# ViewSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ViewSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
ViewSetIterator()
```
```fsharp
new : unit -> ViewSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ViewSetIterator Class

Autodesk.Revit.DB Namespace